gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/SleepMode.c
//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!    \file        System.c
//!    \brief       Functions for the main System.
//!
//!    \author
//!    \date
//!
//!    \notes
//!
//////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
// Header include
//////////////////////////////////////////////////////////////////////////////////////////////////

// C Library includes
#include <string.h>

// STM Library includes
								// NOTE: This file includes all peripheral.h files
#include "stm32f2xx_conf.h"		// Macro: assert_param() for other STM libraries.

// RTOS Library includes
// RTOS Library includes
#include "FreeRTOS.h"
#include "task.h"

// PCOM General Library includes
#include "Types.h"				// Timer depends on Types
#include "Timer.h"				// task depends on Timer for vApplicationTickHook

// PCOM Project Targets
#include "Target.h"				// Hardware target specifications

#include "Rtc.h"
#include "Usart.h"
#include "Spi.h"
#include "Console.h"
#include "Bluetooth.h"
#include "Led.h"

#include "UserIf.h"
// PCOM Library includes
#include "System.h"


///////////////////////////////// FUNCTION DESCRIPTION /////////////////////////////////////////

static BOOL SystemLowPowerModeStop		( void );
static void SystemLowPowerModeStandBy	( void );

///////////////////////////////// FUNCTION DESCRIPTION /////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!	\fn			BOOL SystemClockInitialize( void )
//!
//!	\brief		Setup the microcontroller system clock for the application.
//!
//!	\return		void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SystemClockInitialize( void )
{
	BOOL				fSuccess = FALSE;
    RCC_ClocksTypeDef	tRCC_Clocks;

	RCC_DeInit();											// Resets the RCC clock configuration to the default reset state.
	RCC_HSEConfig( RCC_HSE_ON );							// Configures the External High Speed oscillator.
    fSuccess = RCC_WaitForHSEStartUp();						// Waits on HSERDY flag to be set.

	if( fSuccess == TRUE )
	{
		/*  This group includes the following functions:
			- void FLASH_SetLatency(uint32_t FLASH_Latency)
			To correctly read data from FLASH memory, the number of wait states (LATENCY) 
			must be correctly programmed according to the frequency of the CPU clock 
			(HCLK) and the supply voltage of the device.
		 +-------------------------------------------------------------------------------------+     
		 | Latency       |                HCLK clock frequency (MHz)                           |
		 |               |---------------------------------------------------------------------|     
		 |               | voltage range  | voltage range  | voltage range   | voltage range   |
		 |               | 2.7 V - 3.6 V  | 2.4 V - 2.7 V  | 2.1 V - 2.4 V   | 1.8 V - 2.1 V   |
		 |---------------|----------------|----------------|-----------------|-----------------|              
		 |0WS(1CPU cycle)|0 < HCLK <= 30  |0 < HCLK <= 24  |0 < HCLK <= 18   |0 < HCLK <= 16   |
		 |---------------|----------------|----------------|-----------------|-----------------|   
		 |1WS(2CPU cycle)|30 < HCLK <= 60 |24 < HCLK <= 48 |18 < HCLK <= 36  |16 < HCLK <= 32  | 
		 |---------------|----------------|----------------|-----------------|-----------------|   
		 |2WS(3CPU cycle)|60 < HCLK <= 90 |48 < HCLK <= 72 |36 < HCLK <= 54  |32 < HCLK <= 48  |
		 |---------------|----------------|----------------|-----------------|-----------------| 
		 |3WS(4CPU cycle)|90 < HCLK <= 120|72 < HCLK <= 96 |54 < HCLK <= 72  |48 < HCLK <= 64  |
		 |---------------|----------------|----------------|-----------------|-----------------| 
		 |4WS(5CPU cycle)|      NA        |96 < HCLK <= 120|72 < HCLK <= 90  |64 < HCLK <= 80  |
		 |---------------|----------------|----------------|-----------------|-----------------| 
		 |5WS(6CPU cycle)|      NA        |      NA        |90 < HCLK <= 108 |80 < HCLK <= 96  | 
		 |---------------|----------------|----------------|-----------------|-----------------| 
		 |6WS(7CPU cycle)|      NA        |      NA        |108 < HCLK <= 120|96 < HCLK <= 112 | 
		 |---------------|----------------|----------------|-----------------|-----------------| 
		 |7WS(8CPU cycle)|      NA        |      NA        |     NA          |112 < HCLK <= 120| 
		 |***************|****************|****************|*****************|*****************|*****************************+
		 |               | voltage range  | voltage range  | voltage range   | voltage range   | voltage range 2.7 V - 3.6 V |
		 |               | 2.7 V - 3.6 V  | 2.4 V - 2.7 V  | 2.1 V - 2.4 V   | 1.8 V - 2.1 V   | with External Vpp = 9V      |
		 |---------------|----------------|----------------|-----------------|-----------------|-----------------------------| 
		 |Max Parallelism|      x32       |               x16                |       x8        |          x64                |              
		 |---------------|----------------|----------------|-----------------|-----------------|-----------------------------|   
		 |PSIZE[1:0]     |      10        |               01                 |       00        |           11                |
		 +-------------------------------------------------------------------------------------------------------------------+  
		 */
		// Enable Prefetch Buffer
        FLASH_PrefetchBufferCmd(ENABLE);
       
        // Sets the code latency value: FLASH Two Latency cycles
        FLASH_SetLatency(FLASH_Latency_3);		
				
		/*
		* @param  PLLM: specifies the division factor for PLL VCO input clock
		*          This parameter must be a number between 0 and 63.
		* @note   You have to set the PLLM parameter correctly to ensure that the VCO input
		*         frequency ranges from 1 to 2 MHz. It is recommended to select a frequency
		*         of 2 MHz to limit PLL jitter.
		*  
		* @param  PLLN: specifies the multiplication factor for PLL VCO output clock
		*          This parameter must be a number between 192 and 432.
		* @note   You have to set the PLLN parameter correctly to ensure that the VCO
		*         output frequency is between 192 and 432 MHz.
		*   
		* @param  PLLP: specifies the division factor for main system clock (SYSCLK)
		*          This parameter must be a number in the range {2, 4, 6, or 8}.
		* @note   You have to set the PLLP parameter correctly to not exceed 120 MHz on
		*         the System clock frequency.
		*  
		* @param  PLLQ: specifies the division factor for OTG FS, SDIO and RNG clocks
		*          This parameter must be a number between 4 and 15.
		* @note   If the USB OTG FS is used in your application, you have to set the
		*         PLLQ parameter correctly to have 48 MHz clock for the USB. However,
		*         the SDIO and RNG need a frequency lower than or equal to 48 MHz to work
		*         correctly.
		*/
        UINT32 PLLM = 8;	// M(Div) output Freq = HSE/M	= 16 / 16 = 1   MHz
		UINT32 PLLN = 240;	// N(Mult)output Freq = M * N	= 1 * 240 = 240 MHz
		UINT32 PLLP = 2;	// P(Div) output Freq = N / P	= 240 / 2 = 120 MHz
		UINT32 PLLQ = 5;	// Q(Div) output Freq = N / Q	= 240 / 5 = 48  MHz
		RCC_PLLConfig( RCC_PLLSource_HSE , PLLM, PLLN, PLLP, PLLQ );
		RCC_PLLCmd( ENABLE );
        // Checks whether the specified RCC flag is set or not
        // Wait till PLL is ready
        while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);

