gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/SleepMode.c
		// NOTE!! Depends on the RCC_SYSCLKConfig() Clock source selected is the clock speed you have to divide in the following 
		// three instructions. RCC_HCLKConfig(),RCC_PCLK1Config(), RCC_PCLK2Config()
		// If PLL is enabled, then the Clock signal to be divided is the one comming out of the PLLP clock.
		// NOTE!! APB1 or PCLK1  should not run more than 30 MHz
        // NOTE!! APB2 or PCLK2  should not run more than 60 MHz
		RCC_HCLKConfig( RCC_SYSCLK_Div1 );					// Configures the AHB clock (HCLK).AHB = 120M/1 = 120 MHz
        RCC_PCLK1Config( RCC_HCLK_Div4 );					// Configures the Low Speed APB clock (PCLK1). APB1 = HCLK / 4 = 120 / 4 = 30 MHz
        RCC_PCLK2Config( RCC_HCLK_Div2 );					// Configures the High Speed APB clock (PCLK2). APB2 = HCLK / 2 = 120 / 2 = 60 MHz

		// Configures the system clock Mux (SYSCLK).
        /*	A switch from one clock source to another occurs only if the target
		*	clock source is ready (clock stable after startup delay or PLL locked). 
		*   If a clock source which is not yet ready is selected, the switch will
		*   occur when the clock source will be ready.*/
		RCC_SYSCLKConfig( RCC_SYSCLKSource_PLLCLK );			

		// Get System Clock Source
        // Wait till the clock source configured previously is used as system clock source.
        UINT32 CLOCK_SOURCE_HSI = 0x00;
        UINT32 CLOCK_SOURCE_HSE = 0x04;
        UINT32 CLOCK_SOURCE_PLL = 0x08;        
        while(RCC_GetSYSCLKSource() != CLOCK_SOURCE_PLL);


		// For debugging: you can see the current clock speeds from here.
		RCC_GetClocksFreq( &tRCC_Clocks );
		
		// NOTE: If using FREERTOS make sure to update configCPU_CLOCK_HZ with AHB clock speed!!!(FreeRTOSConfig.h)		
        SystemCoreClock	= tRCC_Clocks.SYSCLK_Frequency;		// Update SystemCoreClock variable according to Clock Register Values		

		/* Flash 2 wait state. */
		*( volatile unsigned long  * )0x40022000 = 0x01;

		// NOTE: NVIC priority group has to be configured for FreeRTOS.		
        /* Set the Vector Table base address at 0x08000000. */
		NVIC_SetVectorTable( NVIC_VectTab_FLASH, 0x0 );

		NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );
	}

	return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!	\fn			void SystemTickInitialize( void )
//!
//!	\brief		Initializes the sysTick to 1 ms interrupts
//!
//!	\return		void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SystemTickInitialize( void )
{
	BOOL fSuccess = FALSE;

	////////////////////////////////////////////////////////////////////////////
	// Setup SysTick Timer for 1 msec interrupts.
	////////////////////////////////////////////////////////////////////////////
	// To adjust the SysTick time base, use the following formula:
	//
    //     Reload Value = SysTick Counter Clock (Hz) x  Desired Time base (s)
    //
	//	- Reload Value is the parameter to be passed for SysTick_Config() function
    //  - Reload Value should not exceed 0xFFFFFF
	//
    //   You can change the SysTick IRQ priority by calling the
    //   NVIC_SetPriority(SysTick_IRQn,...) just after the SysTick_Config() function
    //   call. The NVIC_SetPriority() is defined inside the core_cm3.h file.
	//
	////////////////////////////////////////////////////////////////////////////
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

	//if( SysTick_Config( SystemCoreClock / 8 / 1000 ) == 0 )
    if( SysTick_Config( SystemCoreClock / 1000 ) == 0 )
	{
		//SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);

		fSuccess = TRUE;
	}
    else
    {
        // ERROR: If you reach here, the sysTick couldn't be configured
        while( 1 )
        {}
    }

	return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!	\fn			void SystemGetClockFreq( RCC_ClocksTypeDef *ptSystemClocks )
//!
//!	\brief		Returns a struct with the clock speed of SysClock, AHB, APB1 and APB2
//!
//!	\return		void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void SystemGetClockFreq( RCC_ClocksTypeDef *ptSystemClocks )
{
	if( ptSystemClocks != NULL )
	{
		RCC_GetClocksFreq( ptSystemClocks );
	}
}

void SystemShutDownPeripherals( UINT32 dwWkUpInterruptMaskEnable )
{    
    ////////////////////////////////////////////////////////////////////////////
    // Shutdown all peripherals (low level drivers)
    ////////////////////////////////////////////////////////////////////////////

    // * * * * * * * * * * * * * * * * 
    // USART
    // * * * * * * * * * * * * * * * * 
    // first peripheral to turn off in order to not let the user type more commands
    UsartPortClose( TARGET_USART_PORT_TO_CONSOLE );
    UsartPortClose( TARGET_USART_PORT_TO_MODEM );
    UsartPortClose( TARGET_USART_PORT_TO_BLUETOOTH );

    // * * * * * * * * * * * * * * * * 
    // stop parallel tasks
    // * * * * * * * * * * * * * * * * 
    // Put all tasks that may be turning on GPIOs into a safe state and 
    // suspend the tasks (or stop the scheduler) before sleeping.
    LedTaskEnable( FALSE );

    // * * * * * * * * * * * * * * * * 
    // cut power from other regulators or transistors
    // * * * * * * * * * * * * * * * * 
    // Power line SUP_3V3
        // Dataflash
        // btooth
        // temp sensor[not used]
        // mpu9250 [not used]
        // adc buffers
    GpioWrite(GPIO_SUPPORT_EN, LOW);
    // Power line 3V8 and MDM_3V3(modem)
    GpioWrite(GPIO_MODEM_PWR_EN_OUT, LOW);       

    // * * * * * * * * * * * * * * * * 
    // SPI
    // * * * * * * * * * * * * * * * * 
    SpiBusPowerOnAll( FALSE );                    

    // * * * * * * * * * * * * * * * * 
    // ADC
    // * * * * * * * * * * * * * * * * 
    // Disable ADC to consume less current
    ADC_Cmd( ADC1, DISABLE );
    ADC_Cmd( ADC2, DISABLE );
    ADC_Cmd( ADC3, DISABLE );    

    // * * * * * * * * * * * * * * * * 
    // gpios "outputs" ->low	
    // * * * * * * * * * * * * * * * *
    for( GpioPortEnum eGpioPort = 0; eGpioPort < GPIO_PORT_MAX ; eGpioPort++ )
    {
        for( UINT8 bPinNumber = 0; bPinNumber < 16 ; bPinNumber++ )
        {               
            // ignore JTAG pins
            if
            (
                 ( ( eGpioPort == GPIO_PORT_A ) && ( bPinNumber == 13 ) ) ||
                 ( ( eGpioPort == GPIO_PORT_A ) && ( bPinNumber == 14 ) ) ||
                 ( ( eGpioPort == GPIO_PORT_A ) && ( bPinNumber == 15 ) ) ||
                 ( ( eGpioPort == GPIO_PORT_B ) && ( bPinNumber == 3 ) ) ||
                 ( ( eGpioPort == GPIO_PORT_B ) && ( bPinNumber == 4 ) )
            )
            {
                // do nothing
            }
            else
            {
                // 3rd arg, FALSE = LOW, TRUE = HIGH
                GpioOutputWrite( eGpioPort, bPinNumber, FALSE );
            }
        }
    }

    // * * * * * * * * * * * * * * * * 
    // enable wkup interruptions
    // * * * * * * * * * * * * * * * * 
    // ################################################################
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_1 ) != 0 )
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_1, TRUE );
    }
    else
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_1, FALSE );
    }
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_2 ) != 0 )
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_2, TRUE );
    }
    else
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_2, FALSE );
    }

    // set Rx pin as interrupt pin used to wake up from sleep.
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_CONSOLE_RX ) != 0 )
    {
        UsartConsoleRxInterrEnable( TRUE );    
    }
    else
    {
        UsartConsoleRxInterrEnable( FALSE );    
    }

