gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/SleepMode.c
    // set configuration variables for the [wake up on time match]
    // will wake up when seconds == 0   
    //RTC_WakeUpCmd(ENABLE);

    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_TIME_MATCH ) != 0 )
    {
        RtcInterruptOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_SECOND, 0 );
    }
    else
    {
        RtcInterruptOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_NONE, 0 );
    }

    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_PA0_WKUP ) != 0 )
    {
        ///////////////////////////////        
//        // Clear RCC flags to be able to determine on Wake up the source or the interruption
//        RCC_ClearFlag();
//
//        // Clear Wakeup flag
//        PWR_ClearFlag( PWR_FLAG_WU );
//
//        // Clear StandBy flag
//        PWR_ClearFlag( PWR_FLAG_SB );
//
//        while( PWR_GetFlagStatus( PWR_FLAG_SB ) == SET );
//
//        PWR_WakeUpPinCmd(ENABLE);
        ///////////////////////////////        

        RtcInterruptPinA0Enable( TRUE );        
    }
    else
    {
        //PWR_WakeUpPinCmd(DISABLE);
        RtcInterruptPinA0Enable( FALSE );
    }
    
    // ################################################################
}

void SystemStartUpPeripherals( UINT32 dwWkUpInterruptMaskEnable )
{
    ////////////////////////////////////////////////////////////////////////////
    // Wake up all peripherals (low level drivers)
    ////////////////////////////////////////////////////////////////////////////
    //RCC_ClearFlag();                                            // Clears the RCC reset flags

    // * * * * * * * * * * * * * * * * 
    // disable wkup interruptions
    // * * * * * * * * * * * * * * * *        
    // set Rx pin as interrupt pin used to wake up from sleep.
//    UsartConsoleRxInterrEnable( FALSE );
//    // disable wakeup on time match
//    RtcInterruptOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_NONE, 0 );
//    RtcInterruptPinA0Enable( FALSE );    
//    // keep reed switched enabled since they are required all the time to trigger actions
//    UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_1, TRUE );
//    UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_2, TRUE );

    // ################################################################
    // set Rx pin as interrupt pin used to wake up from sleep.
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_CONSOLE_RX ) != 0 )
    {
        UsartConsoleRxInterrEnable( TRUE );    
    }
    else
    {
        UsartConsoleRxInterrEnable( FALSE );    
    }

    // set configuration variables for the [wake up on time match]
    // will wake up when seconds == 0        
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_TIME_MATCH ) != 0 )
    {
        RtcInterruptOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_SECOND, 0 );
    }
    else
    {
        RtcInterruptOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_NONE, 0 );
    }

    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_PA0_WKUP ) != 0 )
    {
        //PWR_WakeUpPinCmd(ENABLE);
        RtcInterruptPinA0Enable( TRUE );
    }
    else
    {
        //PWR_WakeUpPinCmd(DISABLE);
        RtcInterruptPinA0Enable( FALSE );
    }    

    ///  enable disable reed switches
    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_1 ) != 0 )
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_1, TRUE );
    }
    else
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_1, FALSE );
    }

    if( ( dwWkUpInterruptMaskEnable & SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_2 ) != 0 )
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_2, TRUE );
    }
    else
    {
        UsertIfInterruptPinReedSwtchEnable( USER_IF_REED_SWITCH_2, FALSE );
    }    
    // ################################################################


    // * * * * * * * * * * * * * * * * 
    // gpios 
    // * * * * * * * * * * * * * * * *
    // stay the same.. they will be set high as other 
    // the peripherals start using them.        

    // * * * * * * * * * * * * * * * * 
    // ADC
    // * * * * * * * * * * * * * * * *     
    ADC_Cmd( ADC1, ENABLE );
    ADC_Cmd( ADC2, ENABLE );
    ADC_Cmd( ADC3, ENABLE );    

    // * * * * * * * * * * * * * * * * 
    // SPI
    // * * * * * * * * * * * * * * * * 
    SpiBusPowerOnAll( TRUE );                

    // * * * * * * * * * * * * * * * * 
    // bring power back to regulators or transistors
    // * * * * * * * * * * * * * * * * 
    // Power line SUP_3V3
        // Dataflash
        // btooth
        // temp sensor[not used]
        // mpu9250 [not used]
        // adc buffers
    // important power line to allow the use of dataflash!!
    GpioWrite(GPIO_PIN_SPI1_ACCEL_CS, HIGH);
    // WARNING!! before turning on datatflash, set chip select high.
    GpioWrite(GPIO_PIN_SPI1_DATAFLASH_CS, HIGH);
    // Dataflash always in use to store data from sensors
    GpioWrite(GPIO_SUPPORT_EN, HIGH);
    // Wait for rail to stabilize before continuing
    TimerTaskDelayMs( 100 );
    // Power line 3V8 and MDM_3V3 (modem)
    // this line will be turned on only if modem is required to be used.

    // * * * * * * * * * * * * * * * * 
    // start parallel tasks
    // * * * * * * * * * * * * * * * *     
    LedTaskEnable( TRUE );

    // * * * * * * * * * * * * * * * * 
    // USART
    // * * * * * * * * * * * * * * * * 
    // last peripheral to turn off in order to let the user type commands
    UsartPortOpen( TARGET_USART_PORT_TO_CONSOLE );
    UsartPortOpen( TARGET_USART_PORT_TO_MODEM );
    UsartPortOpen( TARGET_USART_PORT_TO_BLUETOOTH );    
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL SystemSleep( BOOL fStandbySleep )
//!
//! \brief  Put the system to sleep
//!
//! \param[in]  fStandbySleep - TRUE = sleep in stanby mode, FLASE = sleep in stop mode
//!
//! \return BOOL, TRUE if successful, FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SystemSleep( SystemSleepModeEnum eSleepMode )
{
	BOOL            fSuccess                        = FALSE;
    static UINT64   qwTotalAwakeTimeTicksPrevious   = 0;

    if( eSleepMode < SYSTEM_SLEEP_MODE_MAX )
    {                       
        fSuccess = TRUE;

