gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/SleepMode.c
        UINT32 dwInterruptMask;

        // enable the interruptions required for the type of system sleep
        if( eSleepMode == SYSTEM_SLEEP_MODE_STAND_BY )
        {
            dwInterruptMask = 0;                        
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_PA0_WKUP;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_1;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_2;                        
        }
        else
        {            
            dwInterruptMask = 0;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_CONSOLE_RX;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_TIME_MATCH;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_PA0_WKUP;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_1;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_2;            
        }

        SystemShutDownPeripherals( dwInterruptMask );

        // #########################################################################
        ////////////////////////////////////////////////////////////////////////////
        // Put system to sleep
        ////////////////////////////////////////////////////////////////////////////

        if( eSleepMode == SYSTEM_SLEEP_MODE_STAND_BY )
        {
            SystemLowPowerModeStandBy();

            // Should never return from standby mode
            SystemSoftwareReset();
        }
        else if( eSleepMode == SYSTEM_SLEEP_MODE_STOP )
        {
            fSuccess &= SystemLowPowerModeStop();
        }

        // #########################################################################
        
        // enable the interruptions required after waking up
        if( eSleepMode == SYSTEM_SLEEP_MODE_STAND_BY )
        {
            // don't care, should go back to this point
            dwInterruptMask = 0;  
        }
        else
        {            
            dwInterruptMask = 0;            
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_1;
            dwInterruptMask |= SYSTEM_INTERRUPT_MASK_RTC_REED_SWITCH_2;            
        }

        SystemStartUpPeripherals( dwInterruptMask );

    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL SystemLowPowerModeStop( void )
//!
//! \brief  Switch the system into Stop mode
//!
//! \return BOOL, TRUE if successful, FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
/*	Stop mode
	==========
	In Stop mode, all clocks in the 1.2V domain are stopped, the PLL, the HSI,
	and the HSE RC oscillators are disabled. Internal SRAM and register contents
	are preserved.
	The voltage regulator can be configured either in normal or low-power mode.
	To minimize the consumption In Stop mode, FLASH can be powered off before
	entering the Stop mode. It can be switched on again by software after exiting
	the Stop mode using the PWR_FlashPowerDownCmd() function.

    - Entry:
      - The Stop mode is entered using the PWR_EnterSTOPMode(PWR_Regulator_LowPower,)
        function with regulator in LowPower or with Regulator ON.
    - Exit:
      - Any EXTI Line (Internal or External) configured in Interrupt/Event mode.
*/
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SystemLowPowerModeStop( void )
{
    BOOL fSuccess = TRUE;

    // All interruption flags must be cleared!!!
	// RCC flags
    RCC_ClearFlag();

    ////////////////////////////////////////////////////////////
    // Power down *EVERYTHING*
    ////////////////////////////////////////////////////////////
   
    // Disables SysTick interrupts
    //taskDISABLE_INTERRUPTS();
    //__disable_irq(); 
    portENTER_CRITICAL();
	   	
    //vPortSuppressTicksAndSleep( portMAX_DELAY );
    //portSUPPRESS_TICKS_AND_SLEEP();

//	NVIC_InitTypeDef    NVIC_InitStructure;
//	// Config Commons
//	NVIC_InitStructure.NVIC_IRQChannel                      = RTC_Alarm_IRQn;
//	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = configLIBRARY_KERNEL_INTERRUPT_PRIORITY;
//	NVIC_InitStructure.NVIC_IRQChannelSubPriority           = 15;
//    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
//    NVIC_Init( &NVIC_InitStructure );

	//PWR_WakeUpPinCmd(ENABLE);

	// Switch SysClock source to HSI
    RCC_SYSCLKConfig( RCC_SYSCLKSource_HSI );
    while( RCC_GetSYSCLKSource() != 0x00 );     // 0x00: HSI used as system clock

	// Disables the main PLL (In this case PLL is NOT RUNNING)
	RCC_PLLCmd( DISABLE );

	// External High Speed oscillator DISABLED
    RCC_HSEConfig( RCC_HSE_OFF );
    ////////////////////////////////////////////////////////////

	// ########################################################
    PWR_EnterSTOPMode( PWR_Regulator_LowPower, PWR_STOPEntry_WFI );		// Code sits here until interrupt occurs
    // ########################################################


    ////////////////////////////////////////////////////////////
    // Power up *EVERYTHING*
    ////////////////////////////////////////////////////////////
    // Restore SysClock and other clocks
	//RCC_PLLCmd( ENABLE );

	SystemClockInitialize();     

	PWR_WakeUpPinCmd(DISABLE);
	// Config Commons
//	NVIC_InitStructure.NVIC_IRQChannel                      = RTC_Alarm_IRQn;
//	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = configLIBRARY_KERNEL_INTERRUPT_PRIORITY;
//	NVIC_InitStructure.NVIC_IRQChannelSubPriority           = 15;
//    NVIC_InitStructure.NVIC_IRQChannelCmd					= DISABLE;
//    NVIC_Init( &NVIC_InitStructure );

    // Enables SysTick interrupts
	//taskENABLE_INTERRUPTS();
	//__enable_irq();
    portEXIT_CRITICAL();

    ////////////////////////////////////////////////////////////

	RCC_ClearFlag();                                            // Clears the RCC reset flags
    ////////////////////////////////////////////////////////////

