gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/SleepMode.c
    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void SystemLowPowerModeStandBy( void )
//!
//! \brief  Switch the system into Stand by mode
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
/*	Standby mode
	============
	The Standby mode allows to achieve the lowest power consumption. It is based
	on the Cortex-M3 deepsleep mode, with the voltage regulator disabled.
	The 1.2V domain is consequently powered off. The PLL, the HSI oscillator and
	the HSE oscillator are also switched off. SRAM and register contents are lost
	except for the RTC registers, RTC backup registers, backup SRAM and Standby
	circuitry.

	The voltage regulator is OFF.

    - Entry:
      - The Standby mode is entered using the PWR_EnterSTANDBYMode() function.
    - Exit:
      - WKUP pin rising edge, RTC alarm (Alarm A and Alarm B), RTC wakeup,
        tamper event, time-stamp event, external reset in NRST pin, IWDG reset.
*/
//////////////////////////////////////////////////////////////////////////////////////////////////
void SystemLowPowerModeStandBy( void )
{
//	// Clear RCC flags to be able to determine on Wake up the source or the interruption
	RCC_ClearFlag();
//
//	// Clear Wakeup flag
//    PWR_ClearFlag( PWR_FLAG_WU );
//
//    // Clear StandBy flag
//    PWR_ClearFlag( PWR_FLAG_SB );
//
//    while( PWR_GetFlagStatus( PWR_FLAG_SB ) == SET );

	// ########################################################
    PWR_EnterSTANDBYMode();											// Code sits here waiting for an interruption to occur.
    // ########################################################

    // After interruption, system restarts in main, therefore you will never reach this point!!
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void SystemSoftwareReset( void )
//!
//! \brief  Software reset
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void SystemSoftwareReset( void )
{
	// The function initiates a system reset request to reset the MCU.
	NVIC_SystemReset();
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!	\fn			void SystemWatchdogRestart( void )
//!
//!	\brief		Reset system watchdog timer
//!
//!	\return		void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void SystemWatchdogRestart( void )
{
    // Not implement yet.  TODO
}

// EOF //